In [1]:
# pandas is a core library for data manipulation & data analysis
# pandas stands for Panel Data and is the core lirbary for data manipulatin and data analysis
# Single dimensional data is a series object & Multi-dimensional data is a Data-frame
# create a index and series object for one dimentimention object
import pandas as pd
l1 = [10, 20, 30, 40, 50]
s1 = pd.Series(l1)
s1

ModuleNotFoundError: No module named 'pandas'

In [6]:
#changing index numaric to alphabet
s1 = pd.Series(l1, index=['a', 'b', 'c', 'd', 'd'])
s1

a    10
b    20
c    30
d    40
d    50
dtype: int64

In [16]:
# Create a series object from a dictionary
d1 = {
    'samim': 454572,
    'jarifa': 454578,
    'kawser': 454495,
    'ema': 454516
}
s1 = pd.Series(d1)
s1

samim     454572
jarifa    454578
kawser    454495
ema       454516
dtype: int64

In [18]:
#can change the index positions
s2 = pd.Series(d1, index=['jarifa', 'ema', 'kawser', 'samim', 'rafi'])
s2

jarifa    454578.0
ema       454516.0
kawser    454495.0
samim     454572.0
rafi           NaN
dtype: float64

In [19]:
l2 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
s3 = pd.Series(l2)
s3

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [21]:
# print 6 number index data
s3[6]

70

In [22]:
# print sequence of element
s3[:4]

0    10
1    20
2    30
3    40
dtype: int64

In [23]:
# print last 3 element
s3[-3:]

7     80
8     90
9    100
dtype: int64

In [30]:
l5 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
l6 = [10, 20, 30, 40, 50, 60, 70]
s1 = pd.Series(l5)
s2 = pd.Series(l6)
s1, s2

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 0    10
 1    20
 2    30
 3    40
 4    50
 5    60
 6    70
 dtype: int64)

In [32]:
# Adding, mutipli a scalar vlue to series elements
s1 + 4

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
dtype: int64

In [33]:
# Adding two series object
s1 + s2

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5    66.0
6    77.0
7     NaN
8     NaN
dtype: float64